thumb2/nrf51sdk12_3/examples/ble_peripheral/ble_app_hids_keyboard/main.c
static ble_uuid_t m_adv_uuids[] = {{BLE_UUID_HUMAN_INTERFACE_DEVICE_SERVICE, BLE_UUID_TYPE_BLE}};


/** List to enqueue not just data to be sent, but also related information like the handle, connection handle etc */
static buffer_list_t buffer_list;

static void on_hids_evt(ble_hids_t * p_hids, ble_hids_evt_t * p_evt);

typedef struct conn_info 
{
    volatile uint32_t conn_id;
    ble_gap_addr_t addr;
} conn_info;
conn_info* connection_info;//  __attribute__((at(0x20006000)));
//conn_info connection_info  __attribute__( ( section( "NoInit"), zero_init) );

/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in]   line_num   Line number of the failing ASSERT call.
 * @param[in]   file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Fetch the list of peer manager peer IDs.
 *
 * @param[inout] p_peers   The buffer where to store the list of peer IDs.
 * @param[inout] p_size    In: The size of the @p p_peers buffer.
 *                         Out: The number of peers copied in the buffer.
 */
static void peer_list_get(pm_peer_id_t * p_peers, uint32_t * p_size)
{
    pm_peer_id_t peer_id;
    uint32_t     peers_to_copy;
    conn_info c_info;
    uint16_t len;
    len = sizeof(c_info);
    peers_to_copy = (*p_size < BLE_GAP_WHITELIST_ADDR_MAX_COUNT) ?
                    *p_size : BLE_GAP_WHITELIST_ADDR_MAX_COUNT;
    peer_id = pm_next_peer_id_get(PM_PEER_ID_INVALID);
    *p_size = 0;
//    NRF_LOG_INFO("Wanted conn id %d, %x, %d.\r\n", connection_info->conn_id, peer_id, pm_peer_count());                
    while ((peer_id != PM_PEER_ID_INVALID) && (peers_to_copy--)) {
//        NRF_LOG_INFO("Current peer id %d.\r\n", peer_id);
        if (pm_peer_data_app_data_load(peer_id, (uint8_t*)&c_info, &len) == NRF_SUCCESS) {
//            NRF_LOG_INFO("Found conn id %d.\r\n", c_info.conn_id);
            if (c_info.conn_id == connection_info->conn_id) {
                pm_id_addr_set(&(c_info.addr));                            
                NRF_LOG_INFO("Whitelist peer id %d, conn id %d.\r\n", peer_id, c_info.conn_id);                
                p_peers[(*p_size)++] = peer_id;
                
            }
        }
        peer_id = pm_next_peer_id_get(peer_id);
    }
}


/**@brief Function for starting advertising.
 */
void advertising_start(void)
{
    ret_code_t ret;

    memset(m_whitelist_peers, PM_PEER_ID_INVALID, sizeof(m_whitelist_peers));
    m_whitelist_peer_cnt = (sizeof(m_whitelist_peers) / sizeof(pm_peer_id_t));

    peer_list_get(m_whitelist_peers, &m_whitelist_peer_cnt);
    /* Do not use the white list */
//    m_whitelist_peer_cnt = 0;
    
    ret = pm_whitelist_set(m_whitelist_peers, m_whitelist_peer_cnt);
    APP_ERROR_CHECK(ret);
    // Setup the device identies list.
    // Some SoftDevices do not support this feature.
    ret = pm_device_identities_list_set(m_whitelist_peers, m_whitelist_peer_cnt);
    if (ret != NRF_ERROR_NOT_SUPPORTED) {
        APP_ERROR_CHECK(ret);
    }

    m_is_wl_changed = false;

    ret = ble_advertising_start(BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(ret);
}



    
/**@brief Function for handling Peer Manager events.
 *
 * @param[in] p_evt  Peer Manager event.
 */
static void pm_evt_handler(pm_evt_t const * p_evt)
{
    ret_code_t err_code;
    uint16_t len = sizeof(conn_info);

    switch (p_evt->evt_id) {
    case PM_EVT_BONDED_PEER_CONNECTED: {
        NRF_LOG_INFO("Connected to a previously bonded device.\r\n");
    }
    break;

    case PM_EVT_CONN_SEC_SUCCEEDED: {
        NRF_LOG_INFO("Connection secured. Role: %d. conn_handle: %d, Procedure: %d\r\n",
                     ble_conn_state_role(p_evt->conn_handle),
                     p_evt->conn_handle,
                     p_evt->params.conn_sec_succeeded.procedure);

        m_peer_id = p_evt->peer_id;
        if (pm_peer_data_app_data_load(m_peer_id, (uint8_t*)connection_info, &len) != NRF_SUCCESS) {
            pm_id_addr_get(&(connection_info->addr));            
            if (pm_peer_data_app_data_store(m_peer_id, (uint8_t*)connection_info, sizeof(conn_info), NULL) == NRF_SUCCESS) {
                NRF_LOG_INFO("Save peer %02x, conn %02x\r\n", m_peer_id, connection_info->conn_id);
            } else {
                NRF_LOG_INFO("Cannot save peer %02x, conn %02x\r\n", m_peer_id, connection_info->conn_id);                
            }
        }

        // Note: You should check on what kind of white list policy your application should use.
        if (p_evt->params.conn_sec_succeeded.procedure == PM_LINK_SECURED_PROCEDURE_BONDING) {
            NRF_LOG_INFO("New Bond, add the peer to the whitelist if possible\r\n");
            NRF_LOG_INFO("\tm_whitelist_peer_cnt %d, MAX_PEERS_WLIST %d\r\n",
                         m_whitelist_peer_cnt + 1,
                         BLE_GAP_WHITELIST_ADDR_MAX_COUNT);
            m_whitelist_peers[0] = m_peer_id;
            err_code = pm_whitelist_set(m_whitelist_peers, m_whitelist_peer_cnt);
            APP_ERROR_CHECK(err_code);
                
            err_code = pm_device_identities_list_set(m_whitelist_peers, m_whitelist_peer_cnt);
            if (err_code != NRF_ERROR_NOT_SUPPORTED) {
                APP_ERROR_CHECK(err_code);
            }

            /* if (m_whitelist_peer_cnt < BLE_GAP_WHITELIST_ADDR_MAX_COUNT) { */
            /*     // Bonded to a new peer, add it to the whitelist. */
                
            /*     m_is_wl_changed = true; */
            /* } */
        }
    }
    break;

    case PM_EVT_CONN_SEC_FAILED: {
        /* Often, when securing fails, it shouldn't be restarted, for security reasons.
         * Other times, it can be restarted directly.
         * Sometimes it can be restarted, but only after changing some Security Parameters.
         * Sometimes, it cannot be restarted until the link is disconnected and reconnected.
         * Sometimes it is impossible, to secure the link, or the peer device does not support it.
         * How to handle this error is highly application dependent. */
    } break;

