thumb2/nrf51sdk12_3/examples/ble_peripheral/ble_app_hids_keyboard/main.c
    bas_init_obj.evt_handler          = NULL;
    bas_init_obj.support_notification = true;
    bas_init_obj.p_report_ref         = NULL;
    bas_init_obj.initial_batt_level   = 100;

    BLE_GAP_CONN_SEC_MODE_SET_ENC_NO_MITM(&bas_init_obj.battery_level_char_attr_md.cccd_write_perm);
    BLE_GAP_CONN_SEC_MODE_SET_ENC_NO_MITM(&bas_init_obj.battery_level_char_attr_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&bas_init_obj.battery_level_char_attr_md.write_perm);

    BLE_GAP_CONN_SEC_MODE_SET_ENC_NO_MITM(&bas_init_obj.battery_level_report_read_perm);

    err_code = ble_bas_init(&m_bas, &bas_init_obj);
    APP_ERROR_CHECK(err_code);

    battery_voltage_init();
}


/**@brief Function for initializing HID Service.
 */
static void hids_init(void)
{
    uint32_t                   err_code;
    ble_hids_init_t            hids_init_obj;
    ble_hids_inp_rep_init_t    input_report_array[3];
    ble_hids_inp_rep_init_t  * p_input_report;
    ble_hids_outp_rep_init_t   output_report_array[1];
    ble_hids_outp_rep_init_t * p_output_report;
    uint8_t                    hid_info_flags;

    memset((void *)input_report_array, 0, sizeof(ble_hids_inp_rep_init_t));
    memset((void *)output_report_array, 0, sizeof(ble_hids_outp_rep_init_t));

    static uint8_t report_map_data[] = {
        0x05, 0x01,       // Usage Page (Generic Desktop)
        0x09, 0x06,       // Usage (Keyboard)
        0xA1, 0x01,       // Collection (Application)
		0x85, 0x01,                     //     Report Id (1)        
        0x05, 0x07,       // Usage Page (Key Codes)
        0x19, 0xe0,       // Usage Minimum (224)
        0x29, 0xe7,       // Usage Maximum (231)
        0x15, 0x00,       // Logical Minimum (0)
        0x25, 0x01,       // Logical Maximum (1)
        0x75, 0x01,       // Report Size (1)
        0x95, 0x08,       // Report Count (8)
        0x81, 0x02,       // Input (Data, Variable, Absolute)

        0x95, 0x01,       // Report Count (1)
        0x75, 0x08,       // Report Size (8)
        0x81, 0x01,       // Input (Constant) reserved byte(1)

        0x95, 0x05,       // Report Count (5)
        0x75, 0x01,       // Report Size (1)
        0x05, 0x08,       // Usage Page (Page# for LEDs)
        0x19, 0x01,       // Usage Minimum (1)
        0x29, 0x05,       // Usage Maximum (5)
        0x91, 0x02,       // Output (Data, Variable, Absolute), Led report
        0x95, 0x01,       // Report Count (1)
        0x75, 0x03,       // Report Size (3)
        0x91, 0x01,       // Output (Data, Variable, Absolute), Led report padding

        0x95, 0x06,       // Report Count (6)
        0x75, 0x08,       // Report Size (8)
        0x15, 0x00,       // Logical Minimum (0)
        0x25, 0x65,       // Logical Maximum (101)
        0x05, 0x07,       // Usage Page (Key codes)
        0x19, 0x00,       // Usage Minimum (0)
        0x29, 0x65,       // Usage Maximum (101)
        0x81, 0x00,       // Input (Data, Array) Key array(6 bytes)

        0x09, 0x05,       // Usage (Vendor Defined)
        0x15, 0x00,       // Logical Minimum (0)
        0x26, 0xFF, 0x00, // Logical Maximum (255)
        0x75, 0x08,       // Report Count (2)
        0x95, 0x02,       // Report Size (8 bit)
        0xB1, 0x02,       // Feature (Data, Variable, Absolute)

#if 1        
        0xC0,              // End Collection (Application)
        0x05, 0x0c,             // USAGE_PAGE (Consumer Devices)
        0x09, 0x01,                    // USAGE (Consumer Control)
        0xa1, 0x01,                    // COLLECTION (Application)
        0x85, 0x02,                    // REPORT_ID (2)
        0x15, 0x00,                    // LOGICAL_MINIMUM (0)
        0x25, 0x01,                    // LOGICAL_MAXIMUM (1)
        0x75, 0x01,                    // REPORT_SIZE (1)
        0x95, 0x18,                    // REPORT_COUNT (2)
        0x09, 0xe2,                    // USAGE (Mute) 0x01
        0x09, 0xe9,                    // USAGE (Volume Up) 0x02
        0x09, 0xea,                    // USAGE (Volume Down) 0x03
        0x09, 0xb5,                    // USAGE (Scan Next Track) 0x04
        0x09, 0xb6,                    // USAGE (Scan Previous Track) 0x05
        0x09, 0xb3,                    // USAGE (Fast Forward) 0x06
        0x09, 0xb4,                    // USAGE (Rewind) 0x07        
        0x09, 0xb7,                    // USAGE (Stop) 0x08
        0x09, 0xcd,                    // USAGE (Play/Pause) 0x09
        0x09, 0x87,                    // USAGE (Media Select) 0x0A
        0x09, 0xb8,                    // USAGE (Media Eject) 0x0B                       
        0x0a, 0x8a, 0x01,              // USAGE (Mail) 0x0C
        0x0a, 0x92, 0x01,              // USAGE (Calculator) 0x0D
        0x0a, 0x94, 0x01,              // USAGE (My Computer) 0x0E        
        0x0a, 0x21, 0x02,              // USAGE (www search) 0x0F
        0x0a, 0x23, 0x02,              // USAGE (www home) 0x10
        0x0a, 0x24, 0x02,              // USAGE (www back) 0x11
        0x0a, 0x25, 0x02,              // USAGE (www forward) 0x12
        0x0a, 0x26, 0x02,              // USAGE (www stop) 0x13
        0x0a, 0x27, 0x02,              // USAGE (www refresh) 0x14        
        0x0a, 0x2a, 0x02,              // USAGE (www favorites) 0x15
        0x81, 0x62,                    // INPUT (Data,Var,Abs,NPrf,Null)
        0xc0,
// System Control Descriptor
        0x05, 0x01,                    /* Usage Page (Generic Desktop) */
        0x09, 0x80,                    /* Usage (System Control) */
        0xA1, 0x01,                    /* Collection (Application) */
        0x85, 0x03,                    /* Report ID 0x03 [SYSTEM CTRL] */
        0x19, 0x81,                    /* Usage minimum (System Sleep) */
        0x29, 0x83,                    /* Usage maximum (System Wake up) */
        0x95, 0x03,                    /* Report count (3) */
        0x81, 0x06,                    /*Input (data, variable, relative, Preferred) */
        0x95, 0x05,                    /* Report count (6) */
        0x81, 0x01,                    /*Input (Constant) */
#endif
        
